rule demoday_akira_ransomextension {
    meta:
        author = "dominicchua@"
        description = "Akira TTP Hunting package for appending extension"
        severity = "Medium"
    events:
    // potential use of WMI for lateral movement
        (
            $a.metadata.event_type = "PROCESS_LAUNCH" or 
            $a.metadata.event_type = "PROCESS_OPEN"
        )
        re.regex($a.principal.process.file.full_path, `\\powershell\.exe$`) nocase
        (
            re.regex($a.target.process.file.full_path, `\\WmiPrvSE\.exe$`) nocase or //wmi exe 
            re.regex($a.target.process.file.full_path, `\\Invoke-WMIMethod\$`) nocase //powershell
        )
        $a_hostname = $a.principal.hostname

        $b.metadata.event_type = $a.metadata.event_type 
        re.regex($b.target.process.command_line, `\\.akira\$`) nocase or
        re.regex($a.target.process.file.full_path, `\\.akira$`) nocase
        $b_hostname = $b.principal.hostname

        //  within a 10m timeframe (move laterally, then discovery on new device)
        $b.metadata.event_timestamp.seconds - $a.metadata.event_timestamp.seconds <= 600

    match: 
        $a_hostname, $b_hostname over 10m
    
    outcome:
        $risk_score = 60 //risky behaviour

    condition:
        $a and $b
}
