rule ttp_chrome_admin_password_reused {
 internal_meta:
    author = "Uppercase"
    uc_author = "vidyagopal"
    strategy = "This rule detects password reuse events for admin users by looking for passwordReuseEvent in Chrome Management logs. The rule checks for events where the action_details field is set to EVENT_RESULT_ALLOWED, indicating that the password reuse was allowed."
    type = "experimental"
    data_source = "Chrome Management"
    platform = "Workspace"
    uc_notify = "email"
    uc_escalation_notify = "email"
    slot_usage = "0.0004"
    rule_id = "e6c065d3-4739-4443-9dce-d937b7bac0e5"
    logic_visibility="public"

customer_meta:
    rule_name = "Admin Password Reuse in Chrome Management"
    description = "This rule detects when an admin user reuses their password on a website. Password reuse is a security risk, as it can allow attackers to gain access to sensitive accounts."
    severity = "Low"
    tactic = "TA0006" //Credential Access
    technique = "T1078.003" //Valid Accounts: Local Accounts

  events:
    $e.metadata.product_event_type = "passwordReuseEvent"
    $e.metadata.product_name = "Chrome Management"
    $e.metadata.vendor_name = "Google"
    $e.principal.user.attribute.labels["is_admin"] = "true"
    $e.security_result.action_details = "EVENT_RESULT_ALLOWED"

    //$url_category = strings.coalesce($e.extracted.fields["url_category"],$e.security_result.category_details)
    //TODO(binlu) : Bring in URL risk score to only filter upon URLs that are risky where the password has been reused
    //$url_visited = strings.coalesce($e.target.resource.name ,$e.target.url)

  outcome:
    $risk_score = 35
    $vendor_name = $e.metadata.vendor_name
    $product_name = $e.metadata.product_name
    $event_count = 1
    $adversary_name = $e.target.resource.name
    $victim_name = $e.principal.user.user_display_name
    $victim_uid = $e.principal.asset.hostname
    $result = "succeeded"
    $result_time = $e.metadata.event_timestamp.seconds

    $hostname = $e.principal.asset.hostname
    $is_admin_user = $e.principal.user.attribute.labels["is_admin"]
    //$url_password_reused_category = $url_category
    //$url = $url_visited

  condition:
    $e
}
